Tekla.Structures.Model.RebarSetExtensions.FromDotStruct(Tekla.Structures.DirectManipulation.Model.Native.dotCurve_t)
Converts a Tekla.Structures.DirectManipulation.Model.Native.dotCurve_t to a list of Segment3 and Arc3.
dotCurve: The Tekla.Structures.DirectManipulation.Model.Native.dotCurve_t struct.
Returns: A list of Segment3 and Arc3.